Ran Plan for 2 projects:

1. dir: `.` workspace: `default`
1. dir: `project_1` workspace: `default`

### 1. dir: `.` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://f3e6e2177b43:4141/lock?id=Sandeep13Paul%252Fterraform_modules%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`

---
### 2. dir: `project_1` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.vm_instance.google_compute_instance.vm_sandeep_tf["vm-sandeep-1"]: Refreshing state... [id=projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/instances/vm-sandeep-1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm_instance.google_compute_instance.vm_sandeep_tf["vm-sandeep-1"] has been deleted
- resource "google_compute_instance" "vm_sandeep_tf" {
      - can_ip_forward       = false -> null
      - cpu_platform         = "AMD Rome" -> null
      - creation_timestamp   = "2025-07-01T01:41:49.924-07:00" -> null
      - current_status       = "RUNNING" -> null
      - deletion_protection  = false -> null
      - effective_labels     = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_display       = false -> null
      - id                   = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/instances/vm-sandeep-1" -> null
      - instance_id          = "8224376888983691682" -> null
      - label_fingerprint    = "vezUS-42LLM=" -> null
      - machine_type         = "e2-medium" -> null
      - metadata             = {
          - "ssh-keys" = <<-EOT
                sandeeppaul:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMVuduDqCtOrLJMatqteLAjRNnvxO9IjMM4T8Cer4Hfp sandeeppaul@Sandeeps-MacBook-Pro.local
            EOT
        } -> null
      - metadata_fingerprint = "yP0ntbg5fnw=" -> null
      - name                 = "vm-sandeep-1" -> null
      - project              = "sunlit-cab-463104-m6" -> null
      - self_link            = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/instances/vm-sandeep-1" -> null
      - tags                 = [
          - "http-server",
          - "https-server",
          - "sandeep-tf",
          - "ssh-enabled",
        ] -> null
      - tags_fingerprint     = "d11NKrTtijo=" -> null
      - terraform_labels     = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - zone                 = "asia-southeast1-b" -> null

      - boot_disk {
          - auto_delete       = true -> null
          - device_name       = "persistent-disk-0" -> null
          - force_attach      = false -> null
          - guest_os_features = [
              - "UEFI_COMPATIBLE",
              - "VIRTIO_SCSI_MULTIQUEUE",
              - "GVNIC",
            ] -> null
          - mode              = "READ_WRITE" -> null
          - source            = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/disks/vm-sandeep-1" -> null

          - initialize_params {
              - architecture                = "X86_64" -> null
              - enable_confidential_compute = false -> null
              - image                       = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-11-bullseye-v20250610" -> null
              - labels                      = {} -> null
              - provisioned_iops            = 0 -> null
              - provisioned_throughput      = 0 -> null
              - resource_policies           = [] -> null
              - size                        = 20 -> null
              - type                        = "pd-standard" -> null
            }
        }

      - network_interface {
          - internal_ipv6_prefix_length = 0 -> null
          - name                        = "nic0" -> null
          - network                     = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/global/networks/default" -> null
          - network_ip                  = "10.148.0.33" -> null
          - queue_count                 = 0 -> null
          - stack_type                  = "IPV4_ONLY" -> null
          - subnetwork                  = "https://www.googleapis.com/compute/v1/projects/sunlit-cab-463104-m6/regions/asia-southeast1/subnetworks/default" -> null
          - subnetwork_project          = "sunlit-cab-463104-m6" -> null

          - access_config {
              - nat_ip       = "34.142.238.164" -> null
              - network_tier = "PREMIUM" -> null
            }
        }

      - scheduling {
          - automatic_restart   = true -> null
          - availability_domain = 0 -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
          - provisioning_model  = "STANDARD" -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vm_instance.google_compute_instance.vm_sandeep_tf["vm-sandeep-1"] will be created
+ resource "google_compute_instance" "vm_sandeep_tf" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + creation_timestamp   = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata             = {
          + "ssh-keys" = <<-EOT
                sandeeppaul:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMVuduDqCtOrLJMatqteLAjRNnvxO9IjMM4T8Cer4Hfp sandeeppaul@Sandeeps-MacBook-Pro.local
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "vm-sandeep-1"
      + project              = "sunlit-cab-463104-m6"
      + self_link            = (known after apply)
      + tags                 = [
          + "http-server",
          + "https-server",
          + "sandeep-tf",
          + "ssh-enabled",
        ]
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                 = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "debian-cloud/debian-11"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 20
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + guest_accelerator {
          + count = (known after apply)
          + type  = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + availability_domain         = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)
          + termination_time            = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project_1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://f3e6e2177b43:4141/lock?id=Sandeep13Paul%252Fterraform_modules%252Fproject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project_1`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
